{
    "process": [
        {
            "heading": "Profiling",
            "description": "We start the process by gathering your academic details, Sports performances, financial affordability, hobbies, and all other details that help us know you better and provide you with the best service"
        },
        {
            "heading": "Course Selection",
            "description": "After analyzing your profile, we suggest the best courses as per your interests and choices.You can select from more than 8000 programs. If students have any kind of doubt regarding the course selection, we also help in resolving them by providing detailed information about the course and comparing two and more courses."
        },
        {
            "heading": "Country",
            "description": " Following course selection, we move towards the country selection process. You can select from the top countries like The UK, The USA, Canada,Australia, Ireland, Singapore, New Zealand, and Dubai. We help you choose your study destination based on factors including Study Cost, Living Cost, Weather,Language, and stay-back preferences."
        },
        {
            "heading": "College",
            "description": "When you are decided about the country, our next step is to get you the right college. We suggest colleges that are best as per your selected program. We represent more than 5000 Colleges which helps students in finding the right college that has all the qualities they want."
        },
        {
            "heading": "Eligibility",
            "description": "To check whether you are eligible for your chosen program, University,and Country, we ensure that you complete all the requirements. The requirements include some well-prepared documents and valid scores in certain exams. The training for IELTS, TOEFL, PTE, DET, GRE, GMAT, and SAT is provided by us.When you meet the exam eligibility, we then focus on preparing all your documents including SOP, LOR, Certificates, Resume, etc."
        },
        {
            "heading": "Application",
            "description": "After providing the list of college details we apply to the specific program and colleges which you have shortlisted."
        },
        {
            "heading": "Confirmation",
            "description": "Every University and College has a turn-around time for issuing the offer Letter or decision of selection. We accurately on a timely basis take follow-up from the University to release offer letters of your Dream Universities. After which we give guidance and also based on your choice Move forward for the further process."
        },
        {
            "heading": "Scholarship",
            "description": "As scholarships are granted based on merit or sports performance or other achievements, we ensure to highlight these things on the profile for the scholarship purpose. And, if the student does not possess any relevant qualifications, we work on developing their profile by helping them obtain certificates,work experience, and other things that can make the student&apos;s profile much stronger than before to get the scholarship."
        },
        {
            "heading": "Education Loan Assistance ",
            "description": "A lot of students require education loans to study abroad but they struggle to find the right granter and right policy. We help students in getting education loans (both Collateral and Non-Collateral) from the nationalized bank for the lowest rate of interest so that no student gets deprived of fulfilling his dream because of financial issues."
        },
        {
            "heading": "Fee Payment Assistance (Forex)",
            "description": "How and when you should make the currency exchange to pay your fees is also suggested by us so that you make the payment safely. "
        },
        {
            "heading": "Visa Application Assistance",
            "description": "In addition to all the above services, we provide support in visa application. Our visa approval rate is very high and your visa gets approved within the least possible time."
        },
        {
            "heading": "Accommodation Assistance",
            "description": "When you are a newcomer in a country, it's difficult to find a place to settle in that is affordable, near to your University, and has all the necessary facilities. We don't want our students to face any problem like this and therefore help them arrange a well-equipped living place."
        },
        {
            "heading": "Flight/Insurance (Forex)",
            "description": " To ensure your safe and affordable journey, our services also include assistance in flight booking and getting an insurance policy."
        },
        {
            "heading": "Pre-departure Briefing",
            "description": "When you are all set to start your study-abroad journey, we guide you with some pre-departure tips about part-time jobs and full-time jobs, OPT (Optional Practical Training) and CPT (Common Proficiency Test), Building Linked in Profile, Alumni Counseling, Faculty, etc.",
            "description1": " We are not limited to sending you abroad, we are always personally connected with all the students which also helps all the new applicants to get insights into the university or country they are visiting.",
            "description2": "So pack your luggage and leave the rest to us!"
        }
    ]
}